app/Controllers/Pedidos.php

SELECT `pedidos`.`id`, `pedidos`.`cliente_id`, COALESCE(clientes.razao_social, "Cliente não informado") AS razao_social, `pedidos`.`status`, COALESCE(SUM(pedido_produtos.preco_unitario * pedido_produtos.quantidade), 0) AS total
FROM `pedidos`
LEFT JOIN `clientes` ON `clientes`.`id` = `pedidos`.`cliente_id`
LEFT JOIN `pedido_produtos` ON `pedido_produtos`.`pedido_id` = `pedidos`.`id`
GROUP BY `pedidos`.`id`, `pedidos`.`cliente_id`, `clientes`.`razao_social`, `pedidos`.`status`
SELECT `produtos`.`id`, `produtos`.`nome`, `produtos`.`preco`
FROM `pedido_produtos`
LEFT JOIN `produtos` ON `produtos`.`id` = `pedido_produtos`.`produto_id`
WHERE `pedido_produtos`.`pedido_id` = '7'
SELECT *
FROM `clientes`
SELECT *
FROM `produtos`
---
    public function index()
    {
       $Pedidos = new PedidoModel();
        $Clientes = new ClienteModel();
        $Produtos = new ProdutoModel();
        $PedidoProdutoModel = new PedidoProdutoModel();

        $pedidos = $Pedidos->select('pedidos.id,
                                    pedidos.cliente_id,
                                    COALESCE(clientes.razao_social, "Cliente não informado") AS razao_social,
                                    pedidos.status,
                                    COALESCE(SUM(pedido_produtos.preco_unitario * pedido_produtos.quantidade), 0) AS total')
            ->join('clientes', 'clientes.id = pedidos.cliente_id', 'left')
            ->join('pedido_produtos', 'pedido_produtos.pedido_id = pedidos.id', 'left')
            ->groupBy('pedidos.id, pedidos.cliente_id, clientes.razao_social, pedidos.status')
            ->findAll();

        // Criar um array associando os produtos a cada pedido
        foreach ($pedidos as &$pedido) {
            $pedido['produtos'] = $PedidoProdutoModel
                ->select('produtos.id, produtos.nome, produtos.preco')
                ->join('produtos', 'produtos.id = pedido_produtos.produto_id', 'left')
                ->where('pedido_produtos.pedido_id', $pedido['id'])
                ->findAll();
        }


        $data = [
            'clientes' => $Clientes->findAll(),
            'produtos' => $Produtos->findAll(),
            'pedidos'  => $pedidos
        ];

INSERT INTO `pedidos` (`cliente_id`, `status`) VALUES ('9', 'Em Aberto')
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '5'
INSERT INTO `pedido_produtos` (`pedido_id`, `produto_id`, `quantidade`, `preco_unitario`) VALUES (12, '5', 1, '16.00')
---
    public function cadastroPedido()
    {
        $Pedidos = new PedidoModel();
        $PedidoProdutos = new PedidoProdutoModel();

        $pedidoData = [
            'cliente_id' => $this->request->getPost('cliente_id'),
            'status' => $this->request->getPost('status'),
        ];
        $pedidoId = $Pedidos->insert($pedidoData);

        $produtos = $this->request->getPost('produto_id');

        if (!empty($produtos)) {
            foreach ($produtos as $produtoId) {
                $produto = (new ProdutoModel())->find($produtoId);
                $PedidoProdutos->insert([
                    'pedido_id' => $pedidoId,
                    'produto_id' => $produtoId,
                    'quantidade' => 1,
                    'preco_unitario' => $produto['preco']
                ]);

DELETE FROM `pedido_produtos`
WHERE `pedido_id` = '12'
DELETE FROM `pedidos`
WHERE `id` IN ('12')
---
    public function deletarPedido($id)
    {
        $Pedidos = new PedidoModel();
        $PedidoProdutos = new PedidoProdutoModel();

        // Remover produtos do pedido
        $PedidoProdutos->where('pedido_id', $id)->delete();

        // Remover o pedido
        $Pedidos->delete($id);