app/Controllers/Produtos.php

    public function index()
    {
        $produtosModel = new ProdutoModel();
        $produtos = $produtosModel->findAll();
---
SELECT *
FROM `produtos`

    public function cadastroProduto()
    {
        $produtos = new ProdutoModel();

        $dados = [
            'nome' => $this->request->getPost('nome'),
            'descricao' => $this->request->getPost('descricao'),
            'preco' => $this->request->getPost('preco')
        ];

        if ($produtos->insert($dados)) {
---
INSERT INTO `produtos` (`nome`, `descricao`, `preco`) VALUES ('teste produto', 'descricao', '15')

    public function editarProduto($id = null)
    {
        $model = new ProdutoModel();
        $id = $id ?? $this->request->getPost('id');

        $produto = $model->find($id);
        if (!$produto) {
            return redirect()->to('/produtos')->with('error', 'Produto não encontrado.');
        }

        $data = [
            'nome' => $this->request->getPost('nome'),
            'descricao' => $this->request->getPost('descricao'),
            'preco' => $this->request->getPost('preco'),
        ];

        $model->update($id, $data);
---
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '6'
UPDATE `produtos` SET `nome` = 'testee', `descricao` = 'descricao', `preco` = '16.00'
WHERE `produtos`.`id` IN ('6')

    public function deletarProduto($id)
    {

        $produtosModel = new ProdutoModel();

        $produtos = $produtosModel->find($id);
        if ($produtos) {
            $produtosModel->delete($id);
---
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '6'
DELETE FROM `produtos`
WHERE `id` IN ('6')